machadevrepos/Vantare_Vantage_Suit/Firmware/Master/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          p_connection_complete_event = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          APP_DBG_MSG(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%x\n", p_connection_complete_event->Connection_Handle);
          APP_DBG_MSG("     - Connection established with Central: @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_connection_complete_event->Peer_Address[5],
                      p_connection_complete_event->Peer_Address[4],
                      p_connection_complete_event->Peer_Address[3],
                      p_connection_complete_event->Peer_Address[2],
                      p_connection_complete_event->Peer_Address[1],
                      p_connection_complete_event->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                      p_connection_complete_event->Conn_Interval*1.25,
                      p_connection_complete_event->Conn_Latency,
                      p_connection_complete_event->Supervision_Timeout*10
                     );

          if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = p_connection_complete_event->Connection_Handle;
          /**
           * SPECIFIC to Custom Template APP
           */
          HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
          HandleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          Custom_APP_Notification(&HandleNotification);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          if (g_leaf_client_connecting != 0U && (p_connection_complete_event->Status != 0U || p_connection_complete_event->Role == 0U))
          {
            g_leaf_client_connecting = 0U;
            EXO_LOG("[BLE][APP][DISC] leaf connect handle=0x%04X status=0x%02X role=%u addr=%02X:%02X:%02X:%02X:%02X:%02X\r\n",
                    (unsigned)p_connection_complete_event->Connection_Handle,
                    (unsigned)p_connection_complete_event->Status,
                    (unsigned)p_connection_complete_event->Role,
                    (unsigned)p_connection_complete_event->Peer_Address[5],
                    (unsigned)p_connection_complete_event->Peer_Address[4],
                    (unsigned)p_connection_complete_event->Peer_Address[3],
                    (unsigned)p_connection_complete_event->Peer_Address[2],
                    (unsigned)p_connection_complete_event->Peer_Address[1],
                    (unsigned)p_connection_complete_event->Peer_Address[0]);
            exo_hub_central_client_on_connection_complete(1U,
                                                          p_connection_complete_event->Status,
                                                          p_connection_complete_event->Connection_Handle,
                                                          p_connection_complete_event->Peer_Address_Type,
                                                          p_connection_complete_event->Peer_Address);
            if (g_phone_connected != 0U)
            {
              BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle = g_phone_connection_handle;
            }
          }
          else
          {
            g_phone_connected = 1U;
            g_phone_connection_handle = p_connection_complete_event->Connection_Handle;
            if (g_leaf_client_connecting != 0U)
            {
              BleApplicationContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
            }
            EXO_LOG("[BLE][APP][DISC] phone connect handle=0x%04X status=0x%02X role=%u leaf_pending=%u addr=%02X:%02X:%02X:%02X:%02X:%02X\r\n",
                    (unsigned)p_connection_complete_event->Connection_Handle,
                    (unsigned)p_connection_complete_event->Status,
                    (unsigned)p_connection_complete_event->Role,
                    (unsigned)g_leaf_client_connecting,
                    (unsigned)p_connection_complete_event->Peer_Address[5],
                    (unsigned)p_connection_complete_event->Peer_Address[4],
                    (unsigned)p_connection_complete_event->Peer_Address[3],
                    (unsigned)p_connection_complete_event->Peer_Address[2],
                    (unsigned)p_connection_complete_event->Peer_Address[1],
                    (unsigned)p_connection_complete_event->Peer_Address[0]);
          }

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          const aci_gap_proc_complete_event_rp0 *p_evt =
              (const aci_gap_proc_complete_event_rp0 *)p_blecore_evt->data;
          aci_gap_proc_complete_event(p_evt->Procedure_Code,
                                      p_evt->Status,
                                      p_evt->Data_Length,
                                      p_evt->Data);
          break;
        }

        case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
        {
          const aci_att_read_by_group_type_resp_event_rp0 *p_evt =
              (const aci_att_read_by_group_type_resp_event_rp0 *)p_blecore_evt->data;
          aci_att_read_by_group_type_resp_event(p_evt->Connection_Handle,
                                                p_evt->Attribute_Data_Length,
                                                p_evt->Data_Length,
                                                p_evt->Attribute_Data_List);
          break;
        }

        case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
        {
          const aci_att_read_by_type_resp_event_rp0 *p_evt =
              (const aci_att_read_by_type_resp_event_rp0 *)p_blecore_evt->data;
          aci_att_read_by_type_resp_event(p_evt->Connection_Handle,
                                          p_evt->Handle_Value_Pair_Length,
                                          p_evt->Data_Length,
                                          p_evt->Handle_Value_Pair_Data);
          break;
        }

        case ACI_GATT_NOTIFICATION_VSEVT_CODE:
        {
          const aci_gatt_notification_event_rp0 *p_evt =
              (const aci_gatt_notification_event_rp0 *)p_blecore_evt->data;
          aci_gatt_notification_event(p_evt->Connection_Handle,
                                      p_evt->Attribute_Handle,
                                      p_evt->Attribute_Value_Length,
                                      p_evt->Attribute_Value);
          break;
        }

