machadevrepos/Vantare_Vantage_Suit/Firmware/Master/STM32_WPAN/App/app_ble.c
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          const aci_gatt_indication_event_rp0 *p_evt =
              (const aci_gatt_indication_event_rp0 *)p_blecore_evt->data;
          aci_gatt_indication_event(p_evt->Connection_Handle,
                                    p_evt->Attribute_Handle,
                                    p_evt->Attribute_Value_Length,
                                    p_evt->Attribute_Value);
          break;
        }

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          const aci_gatt_proc_complete_event_rp0 *p_evt =
              (const aci_gatt_proc_complete_event_rp0 *)p_blecore_evt->data;
          aci_gatt_proc_complete_event(p_evt->Connection_Handle,
                                       p_evt->Error_Code);
          break;
        }

        default:
          break;
      }

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */

        /**
         * SPECIFIC to Custom Template APP
         */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
          mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
          /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */
          break;

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE \r");
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

#if (RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

          /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
#endif /* RADIO_ACTIVITY_EVENT != 0 */

        /* PAIRING */
        case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):
            APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          /* USER CODE BEGIN ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
          break;

        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
		{
	      uint32_t pin;
          APP_DBG_MSG(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE \n");
          pin = BLE_DEFAULT_PIN;
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE_0 */

          ret = aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, pin);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/
          break;
		}

        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          ret = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, YES);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
          break;

        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO \n     - Status: 0x%x\n     - Reason: 0x%x\n", p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          break;
        /* PAIRING */
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GATT_INDICATION_VSEVT_CODE \r");
          aci_gatt_confirm_indication(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
        }
        break;

        case ACI_HAL_WARNING_VSEVT_CODE:
        {
          aci_hal_warning_event_rp0 *p_warning_event;

	      p_warning_event = (aci_hal_warning_event_rp0 *)p_blecore_evt->data;
		  UNUSED(p_warning_event);
          APP_DBG_MSG(">>== ACI_HAL_WARNING_VSEVT_CODE\n");
          APP_DBG_MSG("Warning Type = 0x%02X\n", p_warning_event->Warning_Type);
	      /* USER CODE BEGIN ACI_HAL_WARNING_VSEVT_CODE */

          /* USER CODE END ACI_HAL_WARNING_VSEVT_CODE */
          break;
        }
        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_LeafClientConnecting(void)
{
  g_leaf_client_connecting = 1U;
  BleApplicationContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
  EXO_LOG("[BLE][APP][DISC] connect state=CONNECTING\r\n");
}

void APP_BLE_LeafClientConnectIdle(void)
{
  g_leaf_client_connecting = 0U;
  if (g_phone_connected != 0U)
  {
    BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
    BleApplicationContext.BleApplicationContext_legacy.connectionHandle = g_phone_connection_handle;
  }
  else
  {
    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  }
  EXO_LOG("[BLE][APP][DISC] connect state=IDLE\r\n");
}

uint8_t APP_BLE_LeafClientPrepareScan(void)
{
  if (g_phone_connected != 0U)
  {
    BleApplicationContext.Device_Connection_Status = APP_BLE_SCAN;
    EXO_LOG("[BLE][APP][DISC] scan state=SCAN phone-connected handle=0x%04X\r\n",
            (unsigned)g_phone_connection_handle);
    return 1U;
  }
  if (BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV ||
      BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV)
  {
    if (aci_gap_set_non_discoverable() != BLE_STATUS_SUCCESS)
    {
      EXO_LOG("[BLE][APP][DISC] scan prepare stop-adv failed\r\n");
      return 0U;
    }
    g_leaf_scan_holds_advertising = 1U;
    EXO_LOG("[BLE][APP][DISC] scan prepare stop-adv ok\r\n");
  }
  BleApplicationContext.Device_Connection_Status = APP_BLE_SCAN;
  EXO_LOG("[BLE][APP][DISC] scan state=SCAN\r\n");
  return 1U;
}

void APP_BLE_LeafClientScanIdle(void)
{
  if (g_phone_connected != 0U)
  {
    BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
    BleApplicationContext.BleApplicationContext_legacy.connectionHandle = g_phone_connection_handle;
    EXO_LOG("[BLE][APP][DISC] scan idle phone-connected handle=0x%04X\r\n",
            (unsigned)g_phone_connection_handle);
    return;
  }
  if (g_leaf_scan_holds_advertising != 0U &&
      BleApplicationContext.Device_Connection_Status != APP_BLE_LP_CONNECTING)
  {
    g_leaf_scan_holds_advertising = 0U;
    EXO_LOG("[BLE][APP][DISC] scan idle resume adv\r\n");
    Adv_Request(APP_BLE_FAST_ADV);
  }
}

uint8_t APP_BLE_LeafClientPhoneConnected(void)
{
  return g_phone_connected;
}

